import React from 'react';
import Header from '../components/Header';
import Footer from '../components/Footer';
import SEO from '../components/SEO';
import '../pagescss/AboutUs.css';

const AboutUs = () => {
    return (
        <>
            <SEO 
                title="About Us" 
                description="Learn about Ramayan Research Council's mission, vision, and our efforts to build a grand temple for Maa Sita in Sitamarhi."
            />
            <Header />
            {/* <div className="banner_area">
                <div className="container">
                    <div className="setion_banner">
                        <h1 className="section_heading">सीतामढ़ी में ‘रामायण रिसर्च काउंसिल’ के संकल्प को जानिए</h1>
                    </div>
                </div>
            </div> */}
            <div className="body-container about-us-container">
                <div className="container">
                    {/* <div className="content_section">
                        <div className="two-col-left">
                            <img src="/images/PIC-2.png" alt="template" />
                            <img src="/images/PIC.png" alt="second_picture" />
                        </div>
                    </div> */}
                    <div className="two-col-right">
                        <ul className="ul-pad">
                            <p>‘रामायण रिसर्च काउंसिल’ मां सीताजी के प्राकट्य-क्षेत्र सीतामढ़ी (बिहार) को तीर्थ-क्षेत्र के रूप में विकसित करने तथा सीतामढ़ी में ही माता सीताजी के भव्य मंदिर-निर्माण के लिए वर्ष 2020 से ही प्रयत्न कर रही है। काउंसिल ने पिछले पांच वर्षों के दौरान सीतामढ़ी में, पटना में, दिल्ली समेत कई राज्यों में इस दिशा में कई बार जन-जागरूकता अभियान तथा जन-संपर्क अभियान चलाया, संगोष्ठी का आयोजन किया, साहित्य बंटवाया, प्रेस-वार्ता का आयोजन किया... प्रसन्नता का विषय है, हमारे देश के गृह मंत्री श्री अमित शाह जी ने गुजरात के गांधीनगर में 10 मार्च 2025 को एक कार्यक्रम के दौरान मां सीताजी के प्रकट-स्थल ‘पुनौरा धाम’ में भी मां सीताजी का एक भव्य मंदिर निर्माण की घोषणा की तथा 08 अगस्त 2025 को पुनौरा धाम में मां सीताजी के भव्य मंदिर निर्माण हेतु आधारशिला भी रख दी। </p>
                            <p>वहीं, काउंसिल के प्रयत्नों को देखते हुए बिहार सरकार अंतर्गत बिहार राज्य धार्मिक न्यास पर्षद ने 19 मई 2025 को काउंसिल को लगभग 12 एकड़ भूमि आवंटित कर दी तथा 23 मई 2025 को भूमि के निबंधन की प्रक्रिया भी पूरी हो गई। यह स्थान मां सीताजी के प्राकट्य-स्थान पुनौरा धाम से चार किलोमीटर दूर है। यह भूमि सीतामढ़ी में 833 वर्ष पुराने राघोपुर बखरी स्थित श्रीराम-जानकी स्थान की है, जो आज जीर्ण-शीर्ण अवस्था में है और एक पौराणिक मठ है और मठ के सामने एक खाली ज़मीन है, जिस पर नए मंदिर का निर्माण किया जाना है। काउंसिल परिवार का चिंतन है कि यहां 51 शक्तिपीठों से मिट्टी एवं ज्योत लाकर इस स्थान को एक शक्ति-स्थल के रूप में विकसित करना है।</p>
                            
                            <h3 className="about-us-heading">राघोपुर बखरी स्थित श्रीराम-जानकी स्थान पर ‘रामायण रिसर्च काउंसिल’ का संकल्प-</h3>
                            <p>‘रामायण रिसर्च काउंसिल’ जीर्ण-शीर्ण अवस्था वाले इस पौराणिक मठ को पुनः जीर्णोद्धार कर श्रीराम-जानकी का एक भव्य मंदिर स्थापित करना है, तो वहीं मठ के सामने खाली भूमि पर 51 शक्तिपीठों से मिट्टी एवं ज्योत लाकर इस स्थान को एक शक्ति-स्थल के रूप में विकसित करना है। प्रतिमा के चारों ओर वृताकार रूप से 108 ऐसी प्रतिमाओं का निर्माण होना है जिनसे माता सीताजी के जीवन-दर्शन का उल्लेख हो सके। वृताकार इन 108 प्रतिमाओं का दर्शन नौका-विहार रूप से किया जाना है। नौका विहार हेतु नौका दोनों दिशा- ‘आगमन तथा प्रस्थान’ कर सके, ऐसी रूपरेखा विकसित होगी।    </p>
                            
                            <h3 className="about-us-heading">सीतामढ़ी में मां सीताजी को शक्ति-स्वरूप में विराजमान करने के लिए श्रीराम-जानकी स्थान ही क्यों ?</h3>
                            <p>सीतामढ़ी स्थित पुनौरा धाम मंदिर से चार किलोमीटर दूर दक्षिण पश्चिम में एक गांव राघोपुर बखरी है। तकरीबन 3,000 लोगों की जनसंख्या वाले इस छोटे से गांव की पौराणिक एवं ऐतिहासिक महत्ता को बहुत कम लोग जानते हैं। वैसे तो सीतामढ़ी में माता सीताजी के प्राकट्य को लेकर दो भिन्न मान्यताएं हैं। एक स्थान है- पुनौरा धाम तथा दूसरा- जानकी स्थान। दोनों पर भिन्न-भिन्न रूप से लोगों की आस्था व विश्वास है, लेकिन अगर सीतामढ़ी में सबसे प्राचीन मंदिर के विषय में पूछा जाए तो राघोपुर बखरी स्थित श्रीराम-जानकी स्थान का ही नाम आता है। जीर्ण-शीर्ण अवस्थापूर्ण इस मंदिर में आज भी भगवान के गर्भ-गृह वाले दीवार पर सन् 1193 में निर्मित होने की जानकारी प्राप्त होती है। अर्थात् आज से लगभग 833 वर्ष पुराना स्थान है यह।</p>
                            <p>इस श्रीरामजानकी मठ को लोग स्थानीय जनकपुरधाम के नाम से जानते हैं। इसकी निर्माण शैली, वास्तु और सजावट नेपाल के प्रसिद्ध जनकपुर धाम से मेल खाती है।</p>
                            <p>इस स्थान के महंत श्रीरामलीला दास जी बताते हैं कि उनके दादा गुरु बताते थे कि जब इस मंदिर का निर्माण हुआ था तो मंदिर की चारदीवारी तकरीबन 20 फीट ऊंची थी और मंदिर का भाग तकरीबन एक बीघे में फैला था। वे बताते हैं कि यहां नौ पीढ़ी से उनके पूर्वज महंत इस स्थान का देख-रेख कर रहे हैं। आज भी इस मंदिर में पूर्वी भारत के तकरीबन 2000 से 3000 वर्ष पुराने 'टेराकोटा ब्रिक बंगाली आर्किटेक्चर' की झलक देखी जा सकती है जो मुगलकालीन सभी बंगाली मंदिरों में सामान्य है।</p>
                            <p>मंदिर का मुख्य आकर्षण गर्भगृह के प्रवेश के बायीं ओर लगा विशाल घंटा है, जिसकी शोभा अतुलनीय है। घंटे का वजन तकरीबन 400 किलोग्राम है। इसकी धातु दमामी मठ, नौलखा मंदिर, जनकपुर से मिलती जुलती है। इस घंटा में जंग का कोई निशान नहीं है। इसकी संरचना सम्मोहित करती है। घंटे के नीचे चरण-पादुका स्थित है जिसपर 'श्री चतुर भुजाय नमः' अंकित है। श्रीराम-जानकी स्थान के पास रहने वाले एक ग्रामीण श्री भोला ठाकुर बताते हैं कि एक समय सुबह-सुबह इस घंटे की आवाज़ पास के 10 गांव तक जाती थी। घंटे की टनकार सुनकर ही लोगों की नींद खुलती थी।</p>
                            <h3 className="about-us-heading">श्रीराम-जानकी स्थान पर बने मंदिर में आज भी गर्भ-गृह की रक्षा करते हैं </h3>
                            <h3 className="about-us-heading">श्रीजटायु भगवान और श्रीहनुमानजी</h3>
                        </ul>
                    </div>
                </div>
            </div>
            <Footer />
        </>
    );
};

export default AboutUs;
