import React from 'react';
import SEO from '../components/SEO';
import Header from '../components/Header';
import Footer from '../components/Footer';
import '../pagescss/Profile.css';

const Convenor = () => {
  return (
    <>
      <SEO 
        title="Convenor" 
        description="Message from the Convenor."
      />
      <Header />
      <div className="about_us_gallery">
        <div className="container">
          <div className="president_wrapper">
            <img src="/abimages/convenor.jpg" alt="Convenor" />
            <div className="text_container">
              <div className="top_heading">
                <img src="/abimages/om_icon.png" alt="om" /> संयोजक, रामायण रिसर्च काउंसिल
              </div>
              <div className="name_text">श्री श्री 1008 पूज्य चित्प्रकाशानंद गिरि जी महाराज</div>
              <div className="about_president">
                'रामायण रिसर्च काउंसिल' से जुड़ना मेरे लिए एक सुखद अनुभूति है। काउंसिल कई प्रकल्पों पर कार्य कर रही है।
                अयोध्या में श्रीराम मंदिर संघर्ष पर आधारित ग्रंथ के साथ मां सीताजी के प्राकट्य-स्थल सीतामढ़ी में मां सीताजी का मंदिर निर्माण जैसे हमारे प्रमुख विषय हैं।
                <br /><br />
                वहीं, हम रामायण मंच के माध्यम से छोटे-छोटे स्कूली बच्चों को श्रीरामचरितमानस की चौपाई का अध्ययन करवाते हैं, याद करवाते हैं और उन वीडियोज़ को ‘रामायण मंच’ नाम के एक यू-ट्यूब के माध्यम से प्रसारित करते हैं। अभी भी हमारे इस अभियान से सैंकड़ों बच्चे जुड़ चुके हैं।
                <br /><br />
                व-कल्याण संदेशों को प्रस्तुत किया गया है। हम इस ग्रंथ को विश्व के प्रमुख देशों के बड़े पुस्तकालयों में भी रखवाना चाहते हैं।
                <br /><br />
                हमारी देवभाषा संस्कृत को भी अपनाया जाए, इसके लिए हम ‘रामायण वार्ता’ नाम की पाक्षिक पत्रिका का प्रकाशन करते हैं। आम जन सरलता के साथ संस्कृत सीख सकें, इसके लिए 60 दिन का एक मॉड्यूल तैयार करवा रहे हैं। ें, हमारे प्रतिनिधि आपसे संपर्क कर आगे की कार्यप्रणाली की जानकारी देंगे।
                <br /><br />
                हम चाहते हैं कि आप सभी रामायण रिसर्च काउंसिल के इस अभियान से जुड़ें, क्योंकि जब तक पूरा भारत एवं भारत की मिट्टी से संबंध रखने वाले हर एक महानुभाव इस अभियान से नहीं जुड़ेंगे, तब तक यह यज्ञ अधूरा रहेगा। आप सभी काउंसिल के उद्देश्यों के साथ तन्मयता के साथ जुड़ें, इसी आह्वान के साथ अपने संदेश को आप सभी के बीच प्रसारित कर रहे हैं।
                {/* <span className="read-more"> Read More...</span> */}
              </div>
            </div>
          </div>
        </div>
      </div>
      <Footer />
    </>
  );
};

export default Convenor;
