import React from 'react';
import Header from '../components/Header';
import Footer from '../components/Footer';
import SEO from '../components/SEO';
import '../pagescss/Profile.css';

const GeneralSecretary = () => {
  return (
    <>
      <SEO 
        title="General Secretary" 
        description="Message from the General Secretary."
      />
      <Header />
      <div className="about_us_gallery">
        <div className="container">
          <div className="president_wrapper">
            <img src="/abimages/generalsecretary.jpg" alt="General Secretary" />
            <div className="text_container">
              <div className="top_heading">
                <img src="/abimages/om_icon.png" alt="om" /> महासचिव, रामायण रिसर्च काउंसिल
              </div>
              <div className="name_text">श्री कुमार सुशांत</div>
              <div className="about_president">
                ‘रामायण रिसर्च काउंसिल’ एक केवल संस्था ही नहीं, बल्कि हमारे लिए प्राण-वायु है जिसे हमने वर्ष 2018 से लेकर अब तक जिया है। हमने काउंसिल के उद्देश्यों को ऐसा रखा है जिससे एक सुसंस्कृत समाज का निर्माण हो सके। मैं स्वयं पहले लिखने-पढ़ने वाली पृष्ठभूमि से रहा हूं। कई मीडिया घरानों में अपनी सेवाएं दे चुका था। वर्ष 2016 में मुझे भारत सरकार में कंसलटेंट के रूप में कार्य करने का अवसर भी मिला। वर्ष 2018 में मेरे मन में अयोध्या में प्रभु श्रीराम मंदिर संघर्ष के ऊपर एक पुस्तक लिखने का विचार आया। लिखने, पढ़ने या बोलने में हम प्रभु श्रीराम की कृपा का उल्लेख करते हैं, लेकिन वास्तविकता में मुझे नहीं मालूम था कि प्रभु श्रीराम का कार्य करना दुर्लभ है और अगर प्रभु श्रीराम की दृष्टि पड़ गई तो फिर आपके सारे अनुभव धरे रह जाते हैं, फिर आपको प्रभु ही चलाते हैं, बेशर्ते अपना हृदय स्वच्छ हो, जहां प्रभु का वास हो सके।
                <br /><br />
                मैंने अयोध्या में प्रभु श्रीराम मंदिर पर पुस्तक लिखना शुरू किया, लेकिन वह धीरे-धीरे कैसे ग्रंथ के स्वरूप में आ गया, मुझे मालूम ही नहीं हुआ। ग्रंथ लिखने के दौरान देश के लोकप्रिय प्रधानमंत्री जी का स्नेह भी प्राप्त हुआ जिससे वह ग्रंथ हिन्दी में पूर्ण हो सका। ग्रंथ लिखने के ही क्रम में मैंने स्वप्न में मां सीताजी के बनते मंदिर की रचना देखी। पता नहीं क्या था। मगर अगले ही दिन चित्रकूट में श्रीकामतानाथजी की परिक्रमा के दौरान मैंने प्रभु ने इस शरीर से मां सीताजी के मंदिर निर्माण का आशीष मांगा।
                <br /><br />
                मैं अपने पूज्य गुरुदेव भगवान श्री श्री 1008 परम पूज्य सांदीपेंद्र जी महाराज का विशेष रूप से आभारी हूं जिन्होंने हाथ पकड़कर मेरा और काउंसिल का सदैव मार्गदर्शन किया है।
                <br /><br />
                मां भगवती की कृपा देखिए कि वर्ष 2019 से लेकर 6 वर्षों के अथक संघर्ष के बाद बिहार सरकार ने काउंसिल के द्वारा सीतामढ़ी में किए जा रहे प्रयासों को समझा और सीतामढ़ी में सरकार ने भूमि उपलब्ध करा दी। अब हम सब मिलकर सीतामढ़ी में मां सीताजी के मंदिर निर्माण की ओर अग्रसर हो रहे हैं।
                <br /><br />
                आप सभी इस उद्देश्य के साथ जुड़ें और अधिक से अधिक को जोड़ें। यह आपका विषय है। यह इस धरा का विषय है, क्योंकि मां सीताजी धरा-पुत्री हैं। इसी आह्वान के साथ आप सभी को प्रणाम। जय सीता राम।
              </div>
            </div>
          </div>
        </div>
      </div>
      <Footer />
    </>
  );
};

export default GeneralSecretary;
