import React, { useState } from 'react';
import Header from '../components/Header';
import Footer from '../components/Footer';
import SEO from '../components/SEO';
import '../pagescss/Profile.css';

const President = () => {
  const [showMore, setShowMore] = useState(false);

  return (
    <>
      <SEO 
        title="President" 
        description="Message from the President of Ramayan Research Council."
      />
      <Header />
      <div className="about_us_gallery">
        <div className="container">
          <div className="president_wrapper">
            <img src="/abimages/presidentImg.jpg" alt="President" />
            <div className="text_container">
              <div className="top_heading">
                <img src="/abimages/om_icon.png" alt="om" /> अध्यक्ष, रामायण रिसर्च काउंसिल
              </div>
              <div className="name_text">श्री श्री 1008 परमहंस स्वामी सांदीपेंद्र जी महाराज</div>
              <div className="about_president">(माता बगलामुखी मंदिर प्रांगण, नलखेड़ा, मध्य प्रदेश)</div>
              <div className="about_president">
                ‘रामायण रिसर्च काउंसिल’ ट्रस्ट के रूप में पंजीकृत संस्था है, जो देश में सांस्कृतिक मूल्यों के
                संवर्धन हेतु कार्य करती रही है। काउंसिल ने अयोध्या में श्रीराम मंदिर संघर्ष पर भी 1250 पृष्ठों का एक
                ग्रंथ (श्रीरामलला- मन से मंदिर तक) लिखा है, जो हिन्दी भाषा में पूर्ण हो चुका है। अब कई भाषाओं में
                इसके लेखन पर कार्य जारी है। हिन्दी भाषा में ग्रंथ-लेखन के क्रम में काउंसिल के बोर्ड ऑफ ट्रस्टी के
                अध्यक्ष तथा तत्कालीन रक्षा राज्य मंत्री श्री अजय भट्ट जी तथा काउंसिल के महासचिव श्री कुमार सुशांत ने
                31.08.2021 को मा. प्रधानमंत्री जी को ग्रंथ के विषय में विस्तृत जानकारी भी दी थी।
                <br />
                काउंसिल साहित्य-सृजन हेतु प्रयासरत रहती है। यही कारण है कि काउंसिल संस्कृत भाषा के प्रचार-प्रसार हेतु
                पिछले दो वर्षों से संस्कृत भाषा में पाक्षिक पत्रिका ‘रामायण वार्ता’ के सफल प्रकाशन के पश्चात अब
                संस्कृत के शिक्षण-प्रशिक्षण हेतु 60 दिनों का एक कोर्स भी विकसित कर रही है।
                <br />
                काउंसिल ने बीते महाकुंभ पर भी एक व्यापक सामग्रीपूर्ण कॉफीटेबल बुक को भी तैयार किया है। अवगत कराना है
                कि काउंसिल वर्ष 2020 से ही माता सीताजी के प्राकट्य-क्षेत्र सीतामढ़ी (बिहार) में भव्य मंदिर निर्माण
                सहित तीर्थ क्षेत्र के रूप में विकसित करने की दिशा में भी लगातार प्रयत्नशील रही है। हाल में बिहार राज्य
                धार्मिक न्यास पर्षद ने काउंसिल को सीतामढ़ी में 833 वर्ष प्राचीन मठ ‘श्रीरामजानकी स्थान’ (राघोपुर
                बखरी) पर 12 एकड़ भूमि भी आवंटित की है। इस हेतु 19 मई 2025 को न्यास के निर्देशन के बाद 23 मई को
                सीतामढ़ी में निबंधन की प्रक्रिया भी पूरी हुई।
                {showMore && (
                  <>
                    काउंसिल ने यहां के प्राचीन मठ का जीर्णोद्धार करने एवं 51 शक्तिपीठों से मिट्टी व ज्योत लाकर
                    सीतामढ़ी को एक शक्ति-धाम के रूप में विकसित करने का निर्णय लिया है, जिसमें केंद्र तथा राज्य सरकार का
                    सहयोग अपेक्षित है। इसके अतिरिक्त उक्त स्थल पर एक शक्तिशाली विशाल धनुष-स्वरूप (जो भगवान शंकर द्वारा
                    भगवान परशुरामजी को प्रदान किया गया था, जो बाद में परशुरामजी के द्वारा राजा जनकजी को सौंपा गया था,
                    उसी धनुष पर प्रत्यांचा चढ़ाने का संकल्प मां जानकीजी ने स्वयंवर हेतु लिया था) की प्रतिमा का निर्माण,
                    श्रीहनुमानजी की 108 फीट ऊंची प्रतिमा और श्रीजटायु भगवान की 21 फीट ऊंची प्रतिमा के अलावा, इस मंदिर
                    परिसर में अध्ययन केंद्र, शोध केंद्र, डिजिटल म्यूजियम समेत कई ऐसी सामाजिक और सांस्कृतिक गतिविधियां
                    भी होनी हैं।
                    <br />
                    10 जून 2025 को जाने-माने संतों ने कॉन्स्टिट्यूशन क्लब (नई दिल्ली) में एक प्रेस-वार्ता का आयोजन कर
                    इस विषय की जानकारी भी दी। हमने 20 जुलाई 2025 को सनातन परिवारों को इस कार्य से जोड़ने हेतु एक
                    आमंत्रण-अभियान की भी शुरूआत की है, जिसमें पहला आमंत्रण नलखेड़ा में मां बगलामुखी माता, काल-भैरव जी
                    तथा दक्षिणमुखी हनुमानजी को दिया है।
                    आप सभी इस यज्ञ से बहुत अच्छे मनोभाव से जुड़ें, जिस रूप में भी अपना सहयोग प्रदान करना चाहते हैं, वह
                    करें। यह मां जगदम्बा का महायज्ञ है। महालक्ष्मी जी का आह्वान है। उन्हें स्थापित करने कि लिए पूरा
                    मनोयोग चाहिए।
                    <br />
                    भगवती सब पर कृपा बरसाती रहें।
                  </>
                )}
                {!showMore && (
                  <span className="read-more" onClick={() => setShowMore(true)}>
                    {' '}
                    Read More...
                  </span>
                )}
              </div>
            </div>
          </div>
        </div>
      </div>
      <Footer />
    </>
  );
};

export default President;
